{"format": "layers-model", "generatedBy": "keras v3.3.2", "convertedBy": "TensorFlow.js Converter v4.18.0", "modelTopology": {"keras_version": "3.3.2", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential_7", "trainable": true, "dtype": "float32", "layers": [{"class_name": "InputLayer", "config": {"batch_shape": [null, 20], "dtype": "float32", "sparse": false, "name": "input_layer_7"}}, {"class_name": "Embedding", "config": {"name": "embedding_7", "trainable": true, "dtype": "float32", "input_dim": 44, "output_dim": 20, "embeddings_initializer": {"module": "keras.initializers", "class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "registered_name": null}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false}}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_14", "trainable": true, "dtype": "float32", "layer": {"module": "keras.layers", "class_name": "LSTM", "config": {"name": "forward_lstm_14", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "zero_output_for_mask": true, "units": 20, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "recurrent_initializer": {"module": "keras.initializers", "class_name": "OrthogonalInitializer", "config": {"gain": 1.0, "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 20, 20]}}, "merge_mode": "concat", "backward_layer": {"module": "keras.layers", "class_name": "LSTM", "config": {"name": "backward_lstm_14", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": true, "stateful": false, "unroll": false, "zero_output_for_mask": true, "units": 20, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "recurrent_initializer": {"module": "keras.initializers", "class_name": "OrthogonalInitializer", "config": {"gain": 1.0, "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 20, 20]}}}}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_15", "trainable": true, "dtype": "float32", "layer": {"module": "keras.layers", "class_name": "LSTM", "config": {"name": "forward_lstm_15", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "zero_output_for_mask": false, "units": 40, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "recurrent_initializer": {"module": "keras.initializers", "class_name": "OrthogonalInitializer", "config": {"gain": 1.0, "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 20, 40]}}, "merge_mode": "concat", "backward_layer": {"module": "keras.layers", "class_name": "LSTM", "config": {"name": "backward_lstm_15", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": true, "stateful": false, "unroll": false, "zero_output_for_mask": false, "units": 40, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "recurrent_initializer": {"module": "keras.initializers", "class_name": "OrthogonalInitializer", "config": {"gain": 1.0, "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 20, 40]}}}}, {"class_name": "Dense", "config": {"name": "dense_14", "trainable": true, "dtype": "float32", "units": 44, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_15", "trainable": true, "dtype": "float32", "units": 44, "activation": "softmax", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}], "build_input_shape": [null, 20]}}, "training_config": {"loss": "categorical_crossentropy", "loss_weights": null, "metrics": ["accuracy"], "weighted_metrics": null, "run_eagerly": false, "steps_per_execution": 1, "jit_compile": false, "optimizer_config": {"class_name": "Adam", "config": {"name": "adam", "learning_rate": 0.0010000000474974513, "weight_decay": null, "clipnorm": null, "global_clipnorm": null, "clipvalue": null, "use_ema": false, "ema_momentum": 0.99, "ema_overwrite_frequency": null, "loss_scale_factor": null, "gradient_accumulation_steps": null, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "sequential_7/bidirectional_14/forward_lstm_14/lstm_cell/kernel", "shape": [20, 80], "dtype": "float32"}, {"name": "sequential_7/bidirectional_14/forward_lstm_14/lstm_cell/recurrent_kernel", "shape": [20, 80], "dtype": "float32"}, {"name": "sequential_7/bidirectional_14/forward_lstm_14/lstm_cell/bias", "shape": [80], "dtype": "float32"}, {"name": "sequential_7/bidirectional_14/backward_lstm_14/lstm_cell/kernel", "shape": [20, 80], "dtype": "float32"}, {"name": "sequential_7/bidirectional_14/backward_lstm_14/lstm_cell/recurrent_kernel", "shape": [20, 80], "dtype": "float32"}, {"name": "sequential_7/bidirectional_14/backward_lstm_14/lstm_cell/bias", "shape": [80], "dtype": "float32"}, {"name": "sequential_7/bidirectional_15/forward_lstm_15/lstm_cell/kernel", "shape": [40, 160], "dtype": "float32"}, {"name": "sequential_7/bidirectional_15/forward_lstm_15/lstm_cell/recurrent_kernel", "shape": [40, 160], "dtype": "float32"}, {"name": "sequential_7/bidirectional_15/forward_lstm_15/lstm_cell/bias", "shape": [160], "dtype": "float32"}, {"name": "sequential_7/bidirectional_15/backward_lstm_15/lstm_cell/kernel", "shape": [40, 160], "dtype": "float32"}, {"name": "sequential_7/bidirectional_15/backward_lstm_15/lstm_cell/recurrent_kernel", "shape": [40, 160], "dtype": "float32"}, {"name": "sequential_7/bidirectional_15/backward_lstm_15/lstm_cell/bias", "shape": [160], "dtype": "float32"}, {"name": "sequential_7/dense_14/kernel", "shape": [80, 44], "dtype": "float32"}, {"name": "sequential_7/dense_14/bias", "shape": [44], "dtype": "float32"}, {"name": "sequential_7/dense_15/kernel", "shape": [44, 44], "dtype": "float32"}, {"name": "sequential_7/dense_15/bias", "shape": [44], "dtype": "float32"}, {"name": "sequential_7/embedding_7/embeddings", "shape": [44, 20], "dtype": "float32"}]}]}